# CSV files

In [1]:
import pandas as pd

cars = {
    "Mahindra": ["XUV300", "XUV500", "XUV700", "XUV700ev", "Thar ev", "Thar", "Scorpio"],
    "Hundai": ["i10", "i10 neu", "Grand i10", "i20", "Verna", "Crreta", "Alazar"],
    "Toyota": ["Glanza", "Urban Cruser", "Hyrider", "Hybird", "Innova", "Innova Crysta", "Fortuner"]
}
df = pd.DataFrame(cars)
print(df)
df.to_csv("cars_name.csv", index=False)

   Mahindra     Hundai         Toyota
0    XUV300        i10         Glanza
1    XUV500    i10 neu   Urban Cruser
2    XUV700  Grand i10        Hyrider
3  XUV700ev        i20         Hybird
4   Thar ev      Verna         Innova
5      Thar     Crreta  Innova Crysta
6   Scorpio     Alazar       Fortuner

# read csv

In [2]:
car_ = pd.read_csv("D:\\Python codes\\Basic Codes\\WS Cubes\\cars_name.csv")
print(car_)

   Mahindra     Hundai         Toyota
0    XUV300        i10         Glanza
1    XUV500    i10 neu   Urban Cruser
2    XUV700  Grand i10        Hyrider
3  XUV700ev        i20         Hybird
4   Thar ev      Verna         Innova
5      Thar     Crreta  Innova Crysta
6   Scorpio     Alazar       Fortuner

In [3]:
car_1 = pd.read_csv("D:\\Python codes\\Basic Codes\\WS Cubes\\cars_name.csv", nrows=3)
print(car_1)

  Mahindra     Hundai        Toyota
0   XUV300        i10        Glanza
1   XUV500    i10 neu  Urban Cruser
2   XUV700  Grand i10       Hyrider

In [4]:
car_2 = pd.read_csv("D:\\Python codes\\Basic Codes\\WS Cubes\\cars_name.csv", usecols=["Mahindra", "Toyota"])
print(car_2)

   Mahindra         Toyota
0    XUV300         Glanza
1    XUV500   Urban Cruser
2    XUV700        Hyrider
3  XUV700ev         Hybird
4   Thar ev         Innova
5      Thar  Innova Crysta
6   Scorpio       Fortuner

In [5]:
car_3 = pd.read_csv("D:\\Python codes\\Basic Codes\\WS Cubes\\cars_name.csv", skiprows=2)
print(car_3)

     XUV500    i10 neu   Urban Cruser
0    XUV700  Grand i10        Hyrider
1  XUV700ev        i20         Hybird
2   Thar ev      Verna         Innova
3      Thar     Crreta  Innova Crysta
4   Scorpio     Alazar       Fortuner

In [6]:
car_4 = pd.read_csv("D:\\Python codes\\Basic Codes\\WS Cubes\\cars_name.csv", index_col="Hundai")
print(car_4)

           Mahindra         Toyota
Hundai
i10          XUV300         Glanza
i10 neu      XUV500   Urban Cruser
Grand i10    XUV700        Hyrider
i20        XUV700ev         Hybird
Verna       Thar ev         Innova
Crreta         Thar  Innova Crysta
Alazar      Scorpio       Fortuner

# CSV functions

In [7]:
cars_ = pd.read_csv("D:\\Python codes\\Basic Codes\\WS Cubes\\cars_name.csv")
cars_.index

RangeIndex(start=0, stop=7, step=1)

In [8]:
cars_.columns

Index(['Mahindra', 'Hundai', 'Toyota'], dtype='object')

In [9]:
cars_.describe()

       Mahindra Hundai  Toyota
count         7      7       7
unique        7      7       7
top      XUV300    i10  Glanza
freq          1      1       1

In [10]:
cars_.head(3)

  Mahindra     Hundai        Toyota
0   XUV300        i10        Glanza
1   XUV500    i10 neu  Urban Cruser
2   XUV700  Grand i10       Hyrider

In [11]:
cars_.tail(3)

  Mahindra  Hundai         Toyota
4  Thar ev   Verna         Innova
5     Thar  Crreta  Innova Crysta
6  Scorpio  Alazar       Fortuner

In [12]:
cars_[1:5]

   Mahindra     Hundai        Toyota
1    XUV500    i10 neu  Urban Cruser
2    XUV700  Grand i10       Hyrider
3  XUV700ev        i20        Hybird
4   Thar ev      Verna        Innova

In [13]:
cars_.to_numpy()

array([['XUV300', 'i10', 'Glanza'],
       ['XUV500', 'i10 neu', 'Urban Cruser'],
       ['XUV700', 'Grand i10', 'Hyrider'],
       ['XUV700ev', 'i20', 'Hybird'],
       ['Thar ev', 'Verna', 'Innova'],
       ['Thar', 'Crreta', 'Innova Crysta'],
       ['Scorpio', 'Alazar', 'Fortuner']], dtype=object)

In [14]:
cars_.loc[[2,3,4], ["Mahindra"]]

   Mahindra
2    XUV700
3  XUV700ev
4   Thar ev

In [15]:
cars_.iloc[6, 2]

'Fortuner'